performance/jmeter/report/statistics.json
{
  "DELETE user" : {
    "transaction" : "DELETE user",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 7.0,
    "medianResTime" : 7.0,
    "minResTime" : 7.0,
    "maxResTime" : 7.0,
    "pct1ResTime" : 7.0,
    "pct2ResTime" : 7.0,
    "pct3ResTime" : 7.0,
    "throughput" : 142.85714285714286,
    "receivedKBytesPerSec" : 16.880580357142858,
    "sentKBytesPerSec" : 29.575892857142858
  },
  "PUT update user" : {
    "transaction" : "PUT update user",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 6.0,
    "medianResTime" : 6.0,
    "minResTime" : 6.0,
    "maxResTime" : 6.0,
    "pct1ResTime" : 6.0,
    "pct2ResTime" : 6.0,
    "pct3ResTime" : 6.0,
    "throughput" : 166.66666666666666,
    "receivedKBytesPerSec" : 42.643229166666664,
    "sentKBytesPerSec" : 48.665364583333336
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 5,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 10.0,
    "medianResTime" : 6.0,
    "minResTime" : 2.0,
    "maxResTime" : 32.0,
    "pct1ResTime" : 32.0,
    "pct2ResTime" : 32.0,
    "pct3ResTime" : 32.0,
    "throughput" : 90.9090909090909,
    "receivedKBytesPerSec" : 21.324573863636363,
    "sentKBytesPerSec" : 20.59659090909091
  },
  "POST create user" : {
    "transaction" : "POST create user",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 32.0,
    "medianResTime" : 32.0,
    "minResTime" : 32.0,
    "maxResTime" : 32.0,
    "pct1ResTime" : 32.0,
    "pct2ResTime" : 32.0,
    "pct3ResTime" : 32.0,
    "throughput" : 31.25,
    "receivedKBytesPerSec" : 7.537841796875,
    "sentKBytesPerSec" : 8.453369140625
  },
  "GET user by ID" : {
    "transaction" : "GET user by ID",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 2.0,
    "medianResTime" : 2.0,
    "minResTime" : 2.0,
    "maxResTime" : 2.0,
    "pct1ResTime" : 2.0,
    "pct2ResTime" : 2.0,
    "pct3ResTime" : 2.0,
    "throughput" : 500.0,
    "receivedKBytesPerSec" : 120.60546875,
    "sentKBytesPerSec" : 92.7734375
  },
  "GET all users" : {
    "transaction" : "GET all users",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 3.0,
    "medianResTime" : 3.0,
    "minResTime" : 3.0,
    "maxResTime" : 3.0,
    "pct1ResTime" : 3.0,
    "pct2ResTime" : 3.0,
    "pct3ResTime" : 3.0,
    "throughput" : 333.3333333333333,
    "receivedKBytesPerSec" : 105.46875,
    "sentKBytesPerSec" : 59.244791666666664
  }
}